---
kind: method
id: M:Autodesk.Revit.DB.PerformanceAdviser.Dispose
source: html/039bc5fa-ea47-6383-eb22-6904268b3e24.htm
---
# Autodesk.Revit.DB.PerformanceAdviser.Dispose Method

Releases all resources used by the PerformanceAdviser

## Syntax (C#)
```csharp
public void Dispose()
```